In [2]:
import pandas as pd
from pandas import DataFrame

In [3]:
df = DataFrame

In [4]:
df = pd.read_csv(r"C:\Users\Sett's Wife\Documents\Languages.csv")

In [5]:
df

           No  Respondent LanguageDesireNextYear LanguageWorkedWith
0           0          10               HTML/CSS           HTML/CSS
1           1          10                    NaN               Java
2           2          10                    NaN         JavaScript
3           3          10                    NaN             Python
4           4          10                    NaN                SQL
...       ...         ...                    ...                ...
44324  147017       64938                    NaN               Ruby
44325  147018       64938                    NaN                SQL
44326  147019       64938                 Python                NaN
44327  147029       64938                      R                NaN
44328  147039       64938                    SQL                NaN

[44329 rows x 4 columns]

In [6]:
df.head()

   No  Respondent LanguageDesireNextYear LanguageWorkedWith
0   0          10               HTML/CSS           HTML/CSS
1   1          10                    NaN               Java
2   2          10                    NaN         JavaScript
3   3          10                    NaN             Python
4   4          10                    NaN                SQL

In [7]:
df.tail()

           No  Respondent LanguageDesireNextYear LanguageWorkedWith
44324  147017       64938                    NaN               Ruby
44325  147018       64938                    NaN                SQL
44326  147019       64938                 Python                NaN
44327  147029       64938                      R                NaN
44328  147039       64938                    SQL                NaN

In [8]:
import matplotlib.pyplot as plt

In [9]:
df.shape

(44329, 4)

In [10]:
df.describe()

                  No    Respondent
count   44329.000000  44329.000000
mean    73461.805297  27669.102078
std     42553.849509  18493.191544
min         0.000000     10.000000
25%     36445.000000  12296.000000
50%     73748.000000  25024.000000
75%    110383.000000  46298.000000
max    147039.000000  64938.000000

In [11]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
44324    False
44325    False
44326    False
44327    False
44328    False
Length: 44329, dtype: bool

In [12]:
df = df.drop_duplicates()

In [13]:
df

           No  Respondent LanguageDesireNextYear LanguageWorkedWith
0           0          10               HTML/CSS           HTML/CSS
1           1          10                    NaN               Java
2           2          10                    NaN         JavaScript
3           3          10                    NaN             Python
4           4          10                    NaN                SQL
...       ...         ...                    ...                ...
44324  147017       64938                    NaN               Ruby
44325  147018       64938                    NaN                SQL
44326  147019       64938                 Python                NaN
44327  147029       64938                      R                NaN
44328  147039       64938                    SQL                NaN

[44329 rows x 4 columns]

In [14]:
df.duplicated().sum()

0

In [15]:
df.isnull().sum()

No                            0
Respondent                    0
LanguageDesireNextYear    21228
LanguageWorkedWith        18714
dtype: int64

In [16]:
missing_data = df.isnull()

In [17]:
missing_data.head(5)

      No  Respondent  LanguageDesireNextYear  LanguageWorkedWith
0  False       False                   False               False
1  False       False                    True               False
2  False       False                    True               False
3  False       False                    True               False
4  False       False                    True               False

In [18]:
import numpy as np

In [19]:
df.replace(np.nan, inplace = True)

In [20]:
df

           No  Respondent LanguageDesireNextYear LanguageWorkedWith
0           0          10               HTML/CSS           HTML/CSS
1           1          10               HTML/CSS               Java
2           2          10               HTML/CSS         JavaScript
3           3          10               HTML/CSS             Python
4           4          10               HTML/CSS                SQL
...       ...         ...                    ...                ...
44324  147017       64938                     Go               Ruby
44325  147018       64938                     Go                SQL
44326  147019       64938                 Python                SQL
44327  147029       64938                      R                SQL
44328  147039       64938                    SQL                SQL

[44329 rows x 4 columns]

In [21]:
df.isnull().sum()

No                        0
Respondent                0
LanguageDesireNextYear    0
LanguageWorkedWith        0
dtype: int64

In [22]:
df.duplicated().sum()

0

In [ ]:
#no missing values and no duplicates